export const locationData = {
  서울특별시: {
    강남구: ['개포동', '논현동', '대치동', '도곡동', '삼성동', '수서동', '신사동', '압구정동', '역삼동', '일원동', '청담동'],
    서초구: ['반포동', '서초동', '잠원동', '방배동', '양재동', '우면동'],
    송파구: ['잠실동', '신천동', '가락동', '문정동', '방이동', '석촌동', '송파동', '오금동'],
    용산구: ['한남동', '이촌동', '서빙고동', '문배동', '원효로가', '청파동'],
    마포구: ['공덕동', '도화동', '상암동', '아현동', '염리동', '용강동', '합정동'],
    성동구: ['성수동1가', '성수동2가', '옥수동', '금호동', '행당동', '왕십리동'],
    광진구: ['광장동', '구의동', '자양동', '화양동'],
    동작구: ['흑석동', '상도동', '노량진동', '사당동'],
    양천구: ['목동', '신정동', '신월동'],
    강서구: ['마곡동', '등촌동', '염창동', '화곡동'],
    영등포구: ['여의도동', '문래동', '당산동', '신길동'],
    강동구: ['고덕동', '상일동', '명일동', '암사동', '천호동']
  },
  경기도: {
    성남시: ['분당구 정자동', '분당구 서현동', '분당구 수내동', '분당구 이매동', '분당구 야탑동', '분당구 판교동'],
    과천시: ['별양동', '부림동', '원문동', '갈현동'],
    하남시: ['미사동', '감이동', '덕풍동', '신장동'],
    광명시: ['철산동', '하안동', '소하동', '광명동'],
    수원시: ['영통동', '광교', '정자동', '권선동'],
    용인시: ['수지구 성복동', '수지구 상현동', '기흥구 보정동'],
    고양시: ['일산동구 장항동', '일산서구 주엽동', '덕양구 향동동'],
    화성시: ['동탄', '병점동', '반송동'],
    김포시: ['장기동', '운양동', '구래동']
  },
  인천광역시: {
    연수구: ['송도동', '연수동', '동춘동'],
    서구: ['청라동', '검단동', '원당동'],
    남동구: ['구월동', '논현동', '간석동']
  },
  부산광역시: {
    해운대구: ['우동', '중동', '좌동', '재송동'],
    수영구: ['광안동', '남천동', '민락동'],
    동래구: ['명륜동', '온천동', '사직동']
  }
};
